SolderedElectronics/Dasduino-Board-Definitions-for-Arduino-IDE/Inkplate_core-6.0.0/boards.txt
Inkplate5.menu.DebugLevel.none=None
Inkplate5.menu.DebugLevel.none.build.code_debug=0
Inkplate5.menu.DebugLevel.error=Error
Inkplate5.menu.DebugLevel.error.build.code_debug=1
Inkplate5.menu.DebugLevel.warn=Warn
Inkplate5.menu.DebugLevel.warn.build.code_debug=2
Inkplate5.menu.DebugLevel.info=Info
Inkplate5.menu.DebugLevel.info.build.code_debug=3
Inkplate5.menu.DebugLevel.debug=Debug
Inkplate5.menu.DebugLevel.debug.build.code_debug=4
Inkplate5.menu.DebugLevel.verbose=Verbose
Inkplate5.menu.DebugLevel.verbose.build.code_debug=5

Inkplate5.menu.EraseFlash.none=Disabled
Inkplate5.menu.EraseFlash.none.upload.erase_cmd=
Inkplate5.menu.EraseFlash.all=Enabled
Inkplate5.menu.EraseFlash.all.upload.erase_cmd=-e

##############################################################

Inkplate6V2.name=Soldered Inkplate6

Inkplate6V2.bootloader.tool=esptool_py
Inkplate6V2.bootloader.tool.default=esptool_py

Inkplate6V2.upload.tool=esptool_py
Inkplate6V2.upload.tool.default=esptool_py
Inkplate6V2.upload.tool.network=esp_ota

Inkplate6V2.upload.maximum_size=1310720
Inkplate6V2.upload.maximum_data_size=327680
Inkplate6V2.upload.flags=
Inkplate6V2.upload.extra_flags=

Inkplate6V2.serial.disableDTR=true
Inkplate6V2.serial.disableRTS=true

Inkplate6V2.build.tarch=xtensa
Inkplate6V2.build.bootloader_addr=0x1000
Inkplate6V2.build.target=esp32
Inkplate6V2.build.mcu=esp32
Inkplate6V2.build.core=esp32
Inkplate6V2.build.variant=Inkplate
Inkplate6V2.build.board=INKPLATE6V2

Inkplate6V2.build.f_cpu=240000000L
Inkplate6V2.build.flash_size=4MB
Inkplate6V2.build.flash_freq=80m
Inkplate6V2.build.flash_mode=qio
Inkplate6V2.build.boot=dio
Inkplate6V2.build.partitions=default
Inkplate6V2.build.defines=-DBOARD_HAS_PSRAM -mfix-esp32-psram-cache-strategy=memw
Inkplate6V2.build.extra_libs=

Inkplate6V2.menu.PartitionScheme.huge_app=Huge APP (3MB No OTA/1MB SPIFFS)
Inkplate6V2.menu.PartitionScheme.huge_app.build.partitions=huge_app
Inkplate6V2.menu.PartitionScheme.huge_app.upload.maximum_size=3145728
Inkplate6V2.menu.PartitionScheme.default=Default 4MB with spiffs (1.2MB APP/1.5MB SPIFFS)
Inkplate6V2.menu.PartitionScheme.default.build.partitions=default
Inkplate6V2.menu.PartitionScheme.defaultffat=Default 4MB with ffat (1.2MB APP/1.5MB FATFS)
Inkplate6V2.menu.PartitionScheme.defaultffat.build.partitions=default_ffat
Inkplate6V2.menu.PartitionScheme.default_8MB=8M with spiffs (3MB APP/1.5MB SPIFFS)
Inkplate6V2.menu.PartitionScheme.default_8MB.build.partitions=default_8MB
Inkplate6V2.menu.PartitionScheme.minimal=Minimal (1.3MB APP/700KB SPIFFS)
Inkplate6V2.menu.PartitionScheme.minimal.build.partitions=minimal
Inkplate6V2.menu.PartitionScheme.no_ota=No OTA (2MB APP/2MB SPIFFS)
Inkplate6V2.menu.PartitionScheme.no_ota.build.partitions=no_ota
Inkplate6V2.menu.PartitionScheme.no_ota.upload.maximum_size=2097152
Inkplate6V2.menu.PartitionScheme.noota_3g=No OTA (1MB APP/3MB SPIFFS)
Inkplate6V2.menu.PartitionScheme.noota_3g.build.partitions=noota_3g
Inkplate6V2.menu.PartitionScheme.noota_3g.upload.maximum_size=1048576
Inkplate6V2.menu.PartitionScheme.noota_ffat=No OTA (2MB APP/2MB FATFS)
Inkplate6V2.menu.PartitionScheme.noota_ffat.build.partitions=noota_ffat
Inkplate6V2.menu.PartitionScheme.noota_ffat.upload.maximum_size=2097152
Inkplate6V2.menu.PartitionScheme.noota_3gffat=No OTA (1MB APP/3MB FATFS)
Inkplate6V2.menu.PartitionScheme.noota_3gffat.build.partitions=noota_3gffat
Inkplate6V2.menu.PartitionScheme.noota_3gffat.upload.maximum_size=1048576
Inkplate6V2.menu.PartitionScheme.min_spiffs=Minimal SPIFFS (1.9MB APP with OTA/190KB SPIFFS)
Inkplate6V2.menu.PartitionScheme.min_spiffs.build.partitions=min_spiffs
Inkplate6V2.menu.PartitionScheme.min_spiffs.upload.maximum_size=1966080
Inkplate6V2.menu.PartitionScheme.fatflash=16M Flash (2MB APP/12.5MB FATFS)
Inkplate6V2.menu.PartitionScheme.fatflash.build.partitions=ffat

Inkplate6V2.menu.FlashMode.qio=QIO
Inkplate6V2.menu.FlashMode.qio.build.flash_mode=dio
Inkplate6V2.menu.FlashMode.qio.build.boot=qio
Inkplate6V2.menu.FlashMode.dio=DIO
Inkplate6V2.menu.FlashMode.dio.build.flash_mode=dio
Inkplate6V2.menu.FlashMode.dio.build.boot=dio
Inkplate6V2.menu.FlashMode.qout=QOUT
Inkplate6V2.menu.FlashMode.qout.build.flash_mode=dout
Inkplate6V2.menu.FlashMode.qout.build.boot=qout
Inkplate6V2.menu.FlashMode.dout=DOUT
Inkplate6V2.menu.FlashMode.dout.build.flash_mode=dout
Inkplate6V2.menu.FlashMode.dout.build.boot=dout

Inkplate6V2.menu.FlashFreq.80=80MHz
Inkplate6V2.menu.FlashFreq.80.build.flash_freq=80m
Inkplate6V2.menu.FlashFreq.40=40MHz
Inkplate6V2.menu.FlashFreq.40.build.flash_freq=40m

Inkplate6V2.menu.UploadSpeed.921600=921600
Inkplate6V2.menu.UploadSpeed.921600.upload.speed=921600
Inkplate6V2.menu.UploadSpeed.115200=115200
Inkplate6V2.menu.UploadSpeed.115200.upload.speed=115200
Inkplate6V2.menu.UploadSpeed.256000.windows=256000
Inkplate6V2.menu.UploadSpeed.256000.upload.speed=256000
Inkplate6V2.menu.UploadSpeed.230400.windows.upload.speed=256000
Inkplate6V2.menu.UploadSpeed.230400=230400
Inkplate6V2.menu.UploadSpeed.230400.upload.speed=230400
Inkplate6V2.menu.UploadSpeed.460800.linux=460800
Inkplate6V2.menu.UploadSpeed.460800.macosx=460800
Inkplate6V2.menu.UploadSpeed.460800.upload.speed=460800
Inkplate6V2.menu.UploadSpeed.512000.windows=512000
Inkplate6V2.menu.UploadSpeed.512000.upload.speed=512000

Inkplate6V2.menu.DebugLevel.none=None
Inkplate6V2.menu.DebugLevel.none.build.code_debug=0
Inkplate6V2.menu.DebugLevel.error=Error
Inkplate6V2.menu.DebugLevel.error.build.code_debug=1
Inkplate6V2.menu.DebugLevel.warn=Warn
Inkplate6V2.menu.DebugLevel.warn.build.code_debug=2
Inkplate6V2.menu.DebugLevel.info=Info
Inkplate6V2.menu.DebugLevel.info.build.code_debug=3
Inkplate6V2.menu.DebugLevel.debug=Debug
Inkplate6V2.menu.DebugLevel.debug.build.code_debug=4
Inkplate6V2.menu.DebugLevel.verbose=Verbose
Inkplate6V2.menu.DebugLevel.verbose.build.code_debug=5

Inkplate6V2.menu.EraseFlash.none=Disabled
Inkplate6V2.menu.EraseFlash.none.upload.erase_cmd=
Inkplate6V2.menu.EraseFlash.all=Enabled
Inkplate6V2.menu.EraseFlash.all.upload.erase_cmd=-e

