SolderedElectronics/Dasduino-Board-Definitions-for-Arduino-IDE/Inkplate_core-6.0.0/boards.txt
##############################################################

Inkplate7.name=Soldered Inkplate7

Inkplate7.bootloader.tool=esptool_py
Inkplate7.bootloader.tool.default=esptool_py

Inkplate7.upload.tool=esptool_py
Inkplate7.upload.tool.default=esptool_py
Inkplate7.upload.tool.network=esp_ota

Inkplate7.upload.maximum_size=1310720
Inkplate7.upload.maximum_data_size=327680
Inkplate7.upload.flags=
Inkplate7.upload.extra_flags=

Inkplate7.serial.disableDTR=true
Inkplate7.serial.disableRTS=true

Inkplate7.build.tarch=xtensa
Inkplate7.build.bootloader_addr=0x1000
Inkplate7.build.target=esp32
Inkplate7.build.mcu=esp32
Inkplate7.build.core=esp32
Inkplate7.build.variant=Inkplate
Inkplate7.build.board=INKPLATE7

Inkplate7.build.f_cpu=240000000L
Inkplate7.build.flash_size=4MB
Inkplate7.build.flash_freq=80m
Inkplate7.build.flash_mode=qio
Inkplate7.build.boot=dio
Inkplate7.build.partitions=default
Inkplate7.build.defines=-DBOARD_HAS_PSRAM -mfix-esp32-psram-cache-strategy=memw
Inkplate7.build.extra_libs=

Inkplate7.menu.PartitionScheme.huge_app=Huge APP (3MB No OTA/1MB SPIFFS)
Inkplate7.menu.PartitionScheme.huge_app.build.partitions=huge_app
Inkplate7.menu.PartitionScheme.huge_app.upload.maximum_size=3145728
Inkplate7.menu.PartitionScheme.default=Default 4MB with spiffs (1.2MB APP/1.5MB SPIFFS)
Inkplate7.menu.PartitionScheme.default.build.partitions=default
Inkplate7.menu.PartitionScheme.defaultffat=Default 4MB with ffat (1.2MB APP/1.5MB FATFS)
Inkplate7.menu.PartitionScheme.defaultffat.build.partitions=default_ffat
Inkplate7.menu.PartitionScheme.default_8MB=8M with spiffs (3MB APP/1.5MB SPIFFS)
Inkplate7.menu.PartitionScheme.default_8MB.build.partitions=default_8MB
Inkplate7.menu.PartitionScheme.minimal=Minimal (1.3MB APP/700KB SPIFFS)
Inkplate7.menu.PartitionScheme.minimal.build.partitions=minimal
Inkplate7.menu.PartitionScheme.no_ota=No OTA (2MB APP/2MB SPIFFS)
Inkplate7.menu.PartitionScheme.no_ota.build.partitions=no_ota
Inkplate7.menu.PartitionScheme.no_ota.upload.maximum_size=2097152
Inkplate7.menu.PartitionScheme.noota_3g=No OTA (1MB APP/3MB SPIFFS)
Inkplate7.menu.PartitionScheme.noota_3g.build.partitions=noota_3g
Inkplate7.menu.PartitionScheme.noota_3g.upload.maximum_size=1048576
Inkplate7.menu.PartitionScheme.noota_ffat=No OTA (2MB APP/2MB FATFS)
Inkplate7.menu.PartitionScheme.noota_ffat.build.partitions=noota_ffat
Inkplate7.menu.PartitionScheme.noota_ffat.upload.maximum_size=2097152
Inkplate7.menu.PartitionScheme.noota_3gffat=No OTA (1MB APP/3MB FATFS)
Inkplate7.menu.PartitionScheme.noota_3gffat.build.partitions=noota_3gffat
Inkplate7.menu.PartitionScheme.noota_3gffat.upload.maximum_size=1048576
Inkplate7.menu.PartitionScheme.min_spiffs=Minimal SPIFFS (1.9MB APP with OTA/190KB SPIFFS)
Inkplate7.menu.PartitionScheme.min_spiffs.build.partitions=min_spiffs
Inkplate7.menu.PartitionScheme.min_spiffs.upload.maximum_size=1966080
Inkplate7.menu.PartitionScheme.fatflash=16M Flash (2MB APP/12.5MB FATFS)
Inkplate7.menu.PartitionScheme.fatflash.build.partitions=ffat

Inkplate7.menu.FlashMode.qio=QIO
Inkplate7.menu.FlashMode.qio.build.flash_mode=dio
Inkplate7.menu.FlashMode.qio.build.boot=qio
Inkplate7.menu.FlashMode.dio=DIO
Inkplate7.menu.FlashMode.dio.build.flash_mode=dio
Inkplate7.menu.FlashMode.dio.build.boot=dio
Inkplate7.menu.FlashMode.qout=QOUT
Inkplate7.menu.FlashMode.qout.build.flash_mode=dout
Inkplate7.menu.FlashMode.qout.build.boot=qout
Inkplate7.menu.FlashMode.dout=DOUT
Inkplate7.menu.FlashMode.dout.build.flash_mode=dout
Inkplate7.menu.FlashMode.dout.build.boot=dout

Inkplate7.menu.FlashFreq.80=80MHz
Inkplate7.menu.FlashFreq.80.build.flash_freq=80m
Inkplate7.menu.FlashFreq.40=40MHz
Inkplate7.menu.FlashFreq.40.build.flash_freq=40m

Inkplate7.menu.UploadSpeed.921600=921600
Inkplate7.menu.UploadSpeed.921600.upload.speed=921600
Inkplate7.menu.UploadSpeed.115200=115200
Inkplate7.menu.UploadSpeed.115200.upload.speed=115200
Inkplate7.menu.UploadSpeed.256000.windows=256000
Inkplate7.menu.UploadSpeed.256000.upload.speed=256000
Inkplate7.menu.UploadSpeed.230400.windows.upload.speed=256000
Inkplate7.menu.UploadSpeed.230400=230400
Inkplate7.menu.UploadSpeed.230400.upload.speed=230400
Inkplate7.menu.UploadSpeed.460800.linux=460800
Inkplate7.menu.UploadSpeed.460800.macosx=460800
Inkplate7.menu.UploadSpeed.460800.upload.speed=460800
Inkplate7.menu.UploadSpeed.512000.windows=512000
Inkplate7.menu.UploadSpeed.512000.upload.speed=512000

Inkplate7.menu.DebugLevel.none=None
Inkplate7.menu.DebugLevel.none.build.code_debug=0
Inkplate7.menu.DebugLevel.error=Error
Inkplate7.menu.DebugLevel.error.build.code_debug=1
Inkplate7.menu.DebugLevel.warn=Warn
Inkplate7.menu.DebugLevel.warn.build.code_debug=2
Inkplate7.menu.DebugLevel.info=Info
Inkplate7.menu.DebugLevel.info.build.code_debug=3
Inkplate7.menu.DebugLevel.debug=Debug
Inkplate7.menu.DebugLevel.debug.build.code_debug=4
Inkplate7.menu.DebugLevel.verbose=Verbose
Inkplate7.menu.DebugLevel.verbose.build.code_debug=5

Inkplate7.menu.EraseFlash.none=Disabled
Inkplate7.menu.EraseFlash.none.upload.erase_cmd=
Inkplate7.menu.EraseFlash.all=Enabled
Inkplate7.menu.EraseFlash.all.upload.erase_cmd=-e

##############################################################

Inkplate10V2.name=Soldered Inkplate10

Inkplate10V2.bootloader.tool=esptool_py
Inkplate10V2.bootloader.tool.default=esptool_py

Inkplate10V2.upload.tool=esptool_py
Inkplate10V2.upload.tool.default=esptool_py
Inkplate10V2.upload.tool.network=esp_ota

Inkplate10V2.upload.maximum_size=1310720
Inkplate10V2.upload.maximum_data_size=327680
Inkplate10V2.upload.flags=
Inkplate10V2.upload.extra_flags=

Inkplate10V2.serial.disableDTR=true
Inkplate10V2.serial.disableRTS=true

Inkplate10V2.build.tarch=xtensa
Inkplate10V2.build.bootloader_addr=0x1000
Inkplate10V2.build.target=esp32
Inkplate10V2.build.mcu=esp32
Inkplate10V2.build.core=esp32
Inkplate10V2.build.variant=Inkplate
Inkplate10V2.build.board=INKPLATE10V2

Inkplate10V2.build.f_cpu=240000000L
Inkplate10V2.build.flash_size=4MB
Inkplate10V2.build.flash_freq=80m
Inkplate10V2.build.flash_mode=qio
Inkplate10V2.build.boot=dio
Inkplate10V2.build.partitions=default
Inkplate10V2.build.defines=-DBOARD_HAS_PSRAM -mfix-esp32-psram-cache-strategy=memw
Inkplate10V2.build.extra_libs=

Inkplate10V2.menu.PartitionScheme.huge_app=Huge APP (3MB No OTA/1MB SPIFFS)
Inkplate10V2.menu.PartitionScheme.huge_app.build.partitions=huge_app
Inkplate10V2.menu.PartitionScheme.huge_app.upload.maximum_size=3145728
Inkplate10V2.menu.PartitionScheme.default=Default 4MB with spiffs (1.2MB APP/1.5MB SPIFFS)
Inkplate10V2.menu.PartitionScheme.default.build.partitions=default
Inkplate10V2.menu.PartitionScheme.defaultffat=Default 4MB with ffat (1.2MB APP/1.5MB FATFS)
Inkplate10V2.menu.PartitionScheme.defaultffat.build.partitions=default_ffat
Inkplate10V2.menu.PartitionScheme.default_8MB=8M with spiffs (3MB APP/1.5MB SPIFFS)
Inkplate10V2.menu.PartitionScheme.default_8MB.build.partitions=default_8MB
Inkplate10V2.menu.PartitionScheme.minimal=Minimal (1.3MB APP/700KB SPIFFS)
Inkplate10V2.menu.PartitionScheme.minimal.build.partitions=minimal
Inkplate10V2.menu.PartitionScheme.no_ota=No OTA (2MB APP/2MB SPIFFS)
Inkplate10V2.menu.PartitionScheme.no_ota.build.partitions=no_ota
Inkplate10V2.menu.PartitionScheme.no_ota.upload.maximum_size=2097152
Inkplate10V2.menu.PartitionScheme.noota_3g=No OTA (1MB APP/3MB SPIFFS)
Inkplate10V2.menu.PartitionScheme.noota_3g.build.partitions=noota_3g
Inkplate10V2.menu.PartitionScheme.noota_3g.upload.maximum_size=1048576
Inkplate10V2.menu.PartitionScheme.noota_ffat=No OTA (2MB APP/2MB FATFS)
Inkplate10V2.menu.PartitionScheme.noota_ffat.build.partitions=noota_ffat
Inkplate10V2.menu.PartitionScheme.noota_ffat.upload.maximum_size=2097152
Inkplate10V2.menu.PartitionScheme.noota_3gffat=No OTA (1MB APP/3MB FATFS)
Inkplate10V2.menu.PartitionScheme.noota_3gffat.build.partitions=noota_3gffat
Inkplate10V2.menu.PartitionScheme.noota_3gffat.upload.maximum_size=1048576
Inkplate10V2.menu.PartitionScheme.min_spiffs=Minimal SPIFFS (1.9MB APP with OTA/190KB SPIFFS)
Inkplate10V2.menu.PartitionScheme.min_spiffs.build.partitions=min_spiffs
Inkplate10V2.menu.PartitionScheme.min_spiffs.upload.maximum_size=1966080
Inkplate10V2.menu.PartitionScheme.fatflash=16M Flash (2MB APP/12.5MB FATFS)
Inkplate10V2.menu.PartitionScheme.fatflash.build.partitions=ffat

Inkplate10V2.menu.FlashMode.qio=QIO
Inkplate10V2.menu.FlashMode.qio.build.flash_mode=dio
Inkplate10V2.menu.FlashMode.qio.build.boot=qio
Inkplate10V2.menu.FlashMode.dio=DIO
Inkplate10V2.menu.FlashMode.dio.build.flash_mode=dio
Inkplate10V2.menu.FlashMode.dio.build.boot=dio
Inkplate10V2.menu.FlashMode.qout=QOUT
Inkplate10V2.menu.FlashMode.qout.build.flash_mode=dout
Inkplate10V2.menu.FlashMode.qout.build.boot=qout
Inkplate10V2.menu.FlashMode.dout=DOUT
Inkplate10V2.menu.FlashMode.dout.build.flash_mode=dout
Inkplate10V2.menu.FlashMode.dout.build.boot=dout

Inkplate10V2.menu.FlashFreq.80=80MHz
Inkplate10V2.menu.FlashFreq.80.build.flash_freq=80m
Inkplate10V2.menu.FlashFreq.40=40MHz
Inkplate10V2.menu.FlashFreq.40.build.flash_freq=40m

Inkplate10V2.menu.UploadSpeed.921600=921600
Inkplate10V2.menu.UploadSpeed.921600.upload.speed=921600
Inkplate10V2.menu.UploadSpeed.115200=115200
Inkplate10V2.menu.UploadSpeed.115200.upload.speed=115200
Inkplate10V2.menu.UploadSpeed.256000.windows=256000
Inkplate10V2.menu.UploadSpeed.256000.upload.speed=256000
Inkplate10V2.menu.UploadSpeed.230400.windows.upload.speed=256000
Inkplate10V2.menu.UploadSpeed.230400=230400
Inkplate10V2.menu.UploadSpeed.230400.upload.speed=230400
Inkplate10V2.menu.UploadSpeed.460800.linux=460800
Inkplate10V2.menu.UploadSpeed.460800.macosx=460800
Inkplate10V2.menu.UploadSpeed.460800.upload.speed=460800
Inkplate10V2.menu.UploadSpeed.512000.windows=512000
Inkplate10V2.menu.UploadSpeed.512000.upload.speed=512000

Inkplate10V2.menu.DebugLevel.none=None
Inkplate10V2.menu.DebugLevel.none.build.code_debug=0
Inkplate10V2.menu.DebugLevel.error=Error
Inkplate10V2.menu.DebugLevel.error.build.code_debug=1
Inkplate10V2.menu.DebugLevel.warn=Warn
Inkplate10V2.menu.DebugLevel.warn.build.code_debug=2
Inkplate10V2.menu.DebugLevel.info=Info
Inkplate10V2.menu.DebugLevel.info.build.code_debug=3
Inkplate10V2.menu.DebugLevel.debug=Debug
Inkplate10V2.menu.DebugLevel.debug.build.code_debug=4
Inkplate10V2.menu.DebugLevel.verbose=Verbose
Inkplate10V2.menu.DebugLevel.verbose.build.code_debug=5

Inkplate10V2.menu.EraseFlash.none=Disabled
Inkplate10V2.menu.EraseFlash.none.upload.erase_cmd=
Inkplate10V2.menu.EraseFlash.all=Enabled
Inkplate10V2.menu.EraseFlash.all.upload.erase_cmd=-e

